<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"c41600849b99c28f6d7e721ed7281a090f1ac007687266548d07df5fc18f7690","plan_job_ref":"Job Test terraform-refresh #43 at https://github.com/dflook/terraform-github-actions/actions/runs/15345085202","plan_out_hash":"44d26636c7d9f0d1e75270943c6aaef529c1192a327f06da40d97e456063edcd","plan_hash":"b51c0728ff5b90fd7a0e0142853cb71340b190e37794f2e0a0653f1930427cbd","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-refresh__
:recycle: Skipping refresh of resource state
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # local_file.one will be created
+   resource "local_file" "one" {
+       content              = "this is my first file"
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0777"
+       file_permission      = "0777"
+       filename             = "test"
+       id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Test terraform-refresh #43](https://github.com/dflook/terraform-github-actions/actions/runs/15345085202)